Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппаДоступаКСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПользователиГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступностьСкладов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиПравДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПравДоступаПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидНаследованияПравДоступаИерархическихСправочников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНаследованияПравДоступаИерархическихСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаСтруктурныхЕдиниц</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбластьДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбластиДанныхОбъектовДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаСтруктурныхЕдиниц</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаследованаОтВсеПользователи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГруппыПользователей/Ext/ObjectModule.bsl
Перем УдалятьЗаписиНастройкиПрав;

Перем УдалятьНастройкиПравБезПредупреждений Экспорт;

Перем ПроверятьНаследуемыеПрава;


////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ

Процедура ЗаписатьУнаследованныеПраваДляВсехГрупп()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяГруппа", ЭтотОбъект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПравДоступаПользователей.ОбъектДоступа,
	|	&ТекущаяГруппа КАК Пользователь,
	|	НастройкиПравДоступаПользователей.ВидОбъектаДоступа,
	|	НастройкиПравДоступаПользователей.ОбластьДанных,
	|	НастройкиПравДоступаПользователей.ВладелецПравДоступа,
	|	ИСТИНА КАК НаследованаОтВсеПользователи,
	|	НастройкиПравДоступаПользователей.Чтение,
	|	НастройкиПравДоступаПользователей.Запись,
	|	НастройкиПравДоступаПользователей.ВидНаследованияПравДоступаИерархическихСправочников
	|ИЗ
	|	РегистрСведений.НастройкиПравДоступаПользователей КАК НастройкиПравДоступаПользователей
	|ГДЕ
	|	НастройкиПравДоступаПользователей.Пользователь = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ПустаяСсылка)";

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Набор = РегистрыСведений.НастройкиПравДоступаПользователей.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Установить(Ссылка);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
		КонецЦикла;
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ОБЪЕКТА

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверятьНаследуемыеПрава = ЭтоНовый();
	
	УдалитьПриНеобходимостиНастройкиПравДоступа();
	
КонецПроцедуры

Процедура УдалитьПриНеобходимостиНастройкиПравДоступа()
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	Справочник.ГруппыПользователей КАК ГруппыПользователей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПравДоступаПользователей КАК НастройкиПравДоступа
		|		ПО НастройкиПравДоступа.Пользователь = ГруппыПользователей.Ссылка
		|ГДЕ
		|	ГруппыПользователей.Ссылка = &Ссылка
		|	И (НЕ ГруппыПользователей.ПометкаУдаления)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Если НЕ УдалятьНастройкиПравБезПредупреждений Тогда
				#Если Клиент Тогда
					ОтветНаВопрос = Вопрос("Удалить настройки прав доступа связанные с группой """ + Наименование + """ (без возможности их восстановления)?", РежимДиалогаВопрос.ДаНет);
					УдалятьЗаписиНастроек = (ОтветНаВопрос = КодВозвратаДиалога.Да);				
				#Иначе
					УдалятьЗаписиНастроек = Истина;
				#КонецЕсли			
			Иначе
				УдалятьЗаписиНастроек = Истина;
			КонецЕсли;
			
			Если УдалятьЗаписиНастроек Тогда
				Набор = РегистрыСведений.НастройкиПравДоступаПользователей.СоздатьНаборЗаписей();
				Набор.Отбор.Пользователь.Установить(ЭтотОбъект.Ссылка);
				Набор.Записать();			
			КонецЕсли;			
		КонецЕсли;
		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Справочник.ГруппыПользователей ГДЕ Ссылка = &Ссылка И ПометкаУдаления";
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			ЗаписатьУнаследованныеПраваДляВсехГрупп();
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ПроверятьНаследуемыеПрава Тогда
		ЗаписатьУнаследованныеПраваДляВсехГрупп();		
	КонецЕсли;
	
КонецПроцедуры


УдалятьНастройкиПравБезПредупреждений = Ложь;
ПроверятьНаследуемыеПрава = Ложь;
